tutorials/incompressible/pimpleSolver/TJunction/0/epsilon
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform 200;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
        mixingLength    0.01;       // 1cm - half channel height
        value           $internalField;
    }

    outlet1
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    outlet2
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    defaultFaces
    {
        type            epsilonWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
