tutorials/incompressible/pimpleSolver/TJunction/0/nut
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet1
    {
        type            calculated;
        value           uniform 0;
    }

    outlet2
    {
        type            calculated;
        value           uniform 0;
    }

    defaultFaces
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
