tutorials/incompressible/pimpleSolver/TJunction/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        SSGS;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    algebraicPair;
        mergeLevels     1;
    }

    pFinal
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0;
        smoother        SSGS;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    algebraicPair;
        mergeLevels     1;
    }

    "(U|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  USGS;
        tolerance       1e-05;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        tolerance       1e-05;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        "U.*"           1;
        "k.*"           1;
        "epsilon.*"     1;
    }
}


// ************************************************************************* //
